load_test.txt
Running 30s test @ https://localhost:8443/message
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   429.93ms  338.93ms   2.00s    62.12%
    Req/Sec   624.62    219.63     1.24k    69.81%
  Latency Distribution
     50%  385.47ms
     75%  613.30ms
     90%  801.87ms
     99%    1.51s 
  72088 requests in 27.75s, 9.21MB read
  Socket errors: connect 0, read 0, write 0, timeout 1510
Requests/sec:   2597.51
Transfer/sec:    339.91KB